<?php


namespace iAmirNet\BehPardakht\Methods;


trait Error
{
    public $errors = [
        "-1" => [
            "fa" => "تراکنش با موفقيت انجام نشد.",
        ],
        "0" => [
            "fa" => "تراکنش با موفقيت انجام شد.",
        ],
        "11" => [
            "fa" => "شماره کارت نامعتبر است.",
        ],
        "12" => [
            "fa" => "موجودی کافي نيست.",
        ],
        "13" => [
            "fa" => "رمز نادرست است.",
        ],
        "14" => [
            "fa" => "تعداد دفعات وارد کردن رمز بيش از حد مجاز است.",
        ],
        "15" => [
            "fa" => "کارت نامعتبر است.",
        ],
        "16" => [
            "fa" => "دفعات برداشت وجه بيش از حد مجاز است.",
        ],
        "17" => [
            "fa" => "کاربر از انجام تراکنش منصرف شده است.",
        ],
        "18" => [
            "fa" => "تاريخ انقضای کارت گذشته است.",
        ],
        "19" => [
            "fa" => "مبلغ برداشت وجه بيش از حد مجاز است.",
        ],
        "111" => [
            "fa" => "صادر کننده کارت نامعتبر است.",
        ],
        "112" => [
            "fa" => "خطای سوييچ صادر کننده کارت.",
        ],
        "113" => [
            "fa" => "پاسخي از صادر کننده کارت دريافت نشد.",
        ],
        "114" => [
            "fa" => "دارنده کارت مجاز به انجام اين تراکنش نيست.",
        ],
        "21" => [
            "fa" => "پذيرنده نامعتبر است.",
        ],
        "23" => [
            "fa" => "خطای امنيتي رخ داده است.",
        ],
        "24" => [
            "fa" => "اطلاعات کاربری پذيرنده نامعتبر است.",
        ],
        "25" => [
            "fa" => "مبلغ نامعتبر است.",
        ],
        "31" => [
            "fa" => "پاسخ نامعتبر است.",
        ],
        "32" => [
            "fa" => "فرمت اطلاعات وارد شده صحيح نمي باشد.",
        ],
        "33" => [
            "fa" => "حساب نامعتبر است.",
        ],
        "34" => [
            "fa" => "خطای سيستمي.",
        ],
        "35" => [
            "fa" => "تاريخ نامعتبر است.",
        ],
        "41" => [
            "fa" => "شماره درخواست تکراری است.",
        ],
        "42" => [
            "fa" => "تراکنش Sale يافت نشد.",
        ],
        "43" => [
            "fa" => "قبلا درخواست Verify داده شده است.",
        ],
        "44" => [
            "fa" => "درخواست Verify يافت نشد.",
        ],
        "45" => [
            "fa" => "تراکنش Settle شده است.",
        ],
        "46" => [
            "fa" => "تراکنش Settle نشده است.",
        ],
        "47" => [
            "fa" => "تراکنش Settle يافت نشد.",
        ],
        "48" => [
            "fa" => "تراکنش Reverse شده است.",
        ],
        "412" => [
            "fa" => "شناسه قبض نادرست است.",
        ],
        "413" => [
            "fa" => "شناسه پرداخت نادرست است.",
        ],
        "414" => [
            "fa" => "سازمان صادر کننده قبض نامعتبر است.",
        ],
        "415" => [
            "fa" => "زمان جلسه کاری به پايان رسيده است.",
        ],
        "416" => [
            "fa" => "خطا در ثبت اطلاعات.",
        ],
        "417" => [
            "fa" => "شناسه پرداخت کننده نامعتبر است.",
        ],
        "418" => [
            "fa" => "اشکال در تعريف اطلاعات مشتری.",
        ],
        "419" => [
            "fa" => "تعداد دفعات ورود اطلاعات از حد مجاز گذشته است.",
        ],
        "421" => [
            "fa" => "IP نامعتبر است.",
        ],
        "51" => [
            "fa" => "تراکنش تکراری است.",
        ],
        "54" => [
            "fa" => "تراکنش مرجع موجود نيست.",
        ],
        "55" => [
            "fa" => "تراکنش نامعتبر است.",
        ],
        "61" => [
            "fa" => "خطا در واريز.",
        ],
        "62" => [
            "fa" => "مسير بازگشت به سايت در دامنه ثبت شده برای پذيرنده قرار ندارد.",
        ],
        "98" => [
            "fa" => "سقف استفاده از رمز ايستا به پايان رسيده است.",
        ],
    ];

    public function getError($num)
    {
        return isset($this->errors[$num]) ? $this->errors[$num][$this->getLang()]: $this->errors["-1"][$this->getLang()];
    }
}