<?php return [
    'plugin' => [
        'name' => 'درگاه پرداخت به پرداخت ملت',
        'description' => 'درگاه پرداخت بانکی به پرداخت ملت برای خرید کاربران',
        'tab' => 'به پرداخت ملت',
        'access_behpardakht' => 'مدیریت درگاه به پرداخت ملت',
    ],
    'behpardakht' => [
        'title' => 'درگاه پرداخت به پرداخت ملت',
        'description' => 'تظیمات درگاه پرداخت به پرداخت ملت',
        'terminal_id' => 'شناسه ترمینال',
        'user_name' => 'نام کاربری',
        'password' => 'رمز عبور',
    ],
];
